
Функция СотрудникПринятНаРаботу(Сотрудник)
	
	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	|	КадровыеПеремещения.Период
//	|ИЗ
//	|	РегистрСведений.КадровыеПеремещения КАК КадровыеПеремещения
//	|ГДЕ
//	|	КадровыеПеремещения.Сотрудник = &Сотрудник
//	|	И
//	|		КадровыеПеремещения.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричинаИзмененияСостояния.ПриемНаРаботу)";
	
//	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
//	Результат = Запрос.Выполнить();
//	Выборка = Результат.Выбрать();
//	Если Выборка.Следующий() Тогда
//		Возврат Истина;
		
//	КонецЕсли;
	
//	Возврат Ложь;


/////Запрос = Новый Запрос;
/////Запрос.Текст =
/////	"ВЫБРАТЬ
/////	|	КадровыеПеремещения.Период
/////	|ИЗ
/////	|	РегистрСведений.КадровыеПеремещения КАК КадровыеПеремещения
/////	|ГДЕ
/////	|	КадровыеПеремещения.Сотрудник = &Сотрудник
/////	|	И КадровыеПеремещения.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричинаИзмененияСостояния.ПриемНаРаботу)";

/////Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

/////РезультатЗапроса = Запрос.Выполнить();

/////Выборка = РезультатЗапроса.Выбрать();

/////Если Выборка.Следующий() Тогда
	/////Возврат Истина;

/////КонецЕсли;
/////Возврат Ложь;


	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.КадровыеПеремещения.Записывать = Истина;
	Движения.КадровыеПеремещения.Очистить();
	
	
	///
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КадровыеПеремещения.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.КадровыеПеремещения КАК КадровыеПеремещения
	|ГДЕ
	|	КадровыеПеремещения.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричинаИзмененияСостояния.ПриемНаРаботу)";

////Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

    РезультатЗапроса = Запрос.Выполнить();
    
    ТабЗнач = РезультатЗапроса.Выгрузить();
    
    ТабЗнач.Индексы.Добавить("Сотрудник"); 
    
    

//Выборка = РезультатЗапроса.Выбрать();

//Если Выборка.Следующий() Тогда
//	Возврат Истина;

//КонецЕсли;
//Возврат Ложь;
	
	
	
	////
	Для Каждого Строка Из Работники Цикл
        МойРезультат = ТабЗнач.Найти(Строка.Сотрудник);
        
        Если МойРезультат <> Неопределено Тогда		
		
//		Если СотрудникПринятНаРаботу(Строка.Сотрудник) Тогда
			Сообщить ("Документ не проведен! Сотрудник уже принят " + Строка.Сотрудник.Наименование);
        	Отказ = Истина;
			Возврат;
		КонецЕсли;	
		
	//проверка
	// регистр КадровыеПеремещения
	
		Движение = Движения.КадровыеПеремещения.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Должность = Строка.Должность;
		Движение.Подразделение = Строка.Подразделение;
      	Движение.Оклад = Строка.Оклад;
 		Движение.ПричинаИзмененияСостояния = Перечисления.ПричинаИзмененияСостояния.ПриемНаРаботу;
   	КонецЦикла;	

КонецПроцедуры
