
Функция СотрудникПринятНаРаботу(Сотрудник)
	
	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	|	КадровыеПеремещения.Период
//	|ИЗ
//	|	РегистрСведений.КадровыеПеремещения КАК КадровыеПеремещения
//	|ГДЕ
//	|	КадровыеПеремещения.Сотрудник = &Сотрудник
//	|	И
//	|		КадровыеПеремещения.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричинаИзмененияСостояния.ПриемНаРаботу)";
	
//	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
//	Результат = Запрос.Выполнить();
//	Выборка = Результат.Выбрать();
//	Если Выборка.Следующий() Тогда
//		Возврат Истина;
		
//	КонецЕсли;
	
//	Возврат Ложь;


Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	КадровыеПеремещения.Период
	|ИЗ
	|	РегистрСведений.КадровыеПеремещения КАК КадровыеПеремещения
	|ГДЕ
	|	КадровыеПеремещения.Сотрудник = &Сотрудник
	|	И КадровыеПеремещения.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричинаИзмененияСостояния.ПриемНаРаботу)";

Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

РезультатЗапроса = Запрос.Выполнить();

Выборка = РезультатЗапроса.Выбрать();

Если Выборка.Следующий() Тогда
	Возврат Истина;

КонецЕсли;
Возврат Ложь;


	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если СотрудникПринятНаРаботу(Сотрудник) Тогда
		Сообщить ("Документ не проведен! Сотрудник уже принят");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
		
	//проверка
	// регистр КадровыеПеремещения
	Движения.КадровыеПеремещения.Записывать = Истина;
	Движение = Движения.КадровыеПеремещения.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Должность = Должность;
	Движение.Подразделение = Подразделение;
    Движение.Оклад = Оклад;
  Движение.ПричинаИзмененияСостояния = Перечисления.ПричинаИзмененияСостояния.ПриемНаРаботу;

КонецПроцедуры
