

&НаСервере
Функция ПолучитьМакетНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("Макет");
	Возврат Макет;

КонецФункции

&НаКлиенте
Процедура ПечатьНашегоДокумента(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ТолькоПросмотр = Истина;	
	
	Макет = ПолучитьМакетНаСервере();
	
//	Макет.Параметры.НомерДоговора = Объект.Номер;
//	Макет.Параметры.ДатаДоговора = Формат(Объект.Дата, "ДФ=dd.MM.yyyy;");
//	Макет.Параметры.Дата = Объект.Дата;
//	Макет.Параметры.Сотрудник = Объект.Сотрудник;
	
//	ТабДок.Вывести(Макет);
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка|До_Подразделения");
	ОбластьШапка.Параметры.НомерДоговора = Объект.Номер;
	ОбластьШапка.Параметры.ДатаДоговора = Формат(Объект.Дата, "ДФ=dd.MM.yyyy;");
	ТабДок.Вывести(ОбластьШапка);
	
	Если Объект.ВыводитьПодразделениеВПечатныхФормах Тогда
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка|Подразделение");
		ТабДок.Присоединить(ОбластьШапка);
	КонецЕсли;	
	
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка|После_Подразделения");
	ТабДок.Присоединить(ОбластьШапка);
	
	 
	Для Каждого Строка Из Объект.Работники Цикл
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ОбластьСтрока.Параметры.Заполнить(Строка);
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;	 
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Дата = Объект.Дата;

	ТабДок.Вывести(ОбластьПодвал);
	ТабДок.Показать("Трудовой договор");
//	ТабДок.Показать("Трудовой договор по сотруднику  " + Объект.Сотрудник );
	
КонецПроцедуры
