&НаСервере
Функция ПолучитьМакетНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("Макет");
	Возврат Макет;

КонецФункции


&НаКлиенте
Процедура ПечатьНашегоДокумента(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакетНаСервере();
	
//	Макет.Параметры.НомерДоговора = Объект.Номер;
//	Макет.Параметры.ДатаДоговора = Формат(Объект.Дата, "ДФ=dd.MM.yyyy;");
//	Макет.Параметры.Дата = Объект.Дата;
//	Макет.Параметры.Сотрудник = Объект.Сотрудник;
	
//	ТабДок.Вывести(Макет);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.НомерДоговора = Объект.Номер;
	ОбластьЗаголовок.Параметры.ДатаДоговора = Формат(Объект.Дата, "ДФ=dd.MM.yyyy;");
	
	ТабДок.Вывести(ОбластьЗаголовок); 
	
	ОбластьТело = Макет.ПолучитьОбласть("Тело");
	ОбластьТело.Параметры.Сотрудник = Объект.Сотрудник;
	
	ТабДок.Вывести(ОбластьТело); 
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Дата = Объект.Дата;

	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.Показать("Трудовой договор по сотруднику  " + Объект.Сотрудник );
	
	
	
	
	
КонецПроцедуры
